package ptuxiaki.extraction;


import org.junit.Assert;
import org.junit.Before;
import org.junit.Test;

import java.util.List;

public class TestParagraphExtraction {

    private TextExtractor extractor;
    private String [] paragraphs;


    @Before
    public void init() {
        paragraphs = new String[2];
        paragraphs[0]  = "Το σύνολο των μελών του Υπουργικού Συμβουλίου κουνούσε προχθές με συγκατάβαση " +
                "το κεφάλι κάθε φορά που ο κ. Σημίτης τόνιζε ότι είναι απόλυτη ανάγκη να υπάρξουν άμεσες," +
                " καίριες και κυρίως αποτελεσματικές λύσεις στα προβλήματα που αντιμετωπίζει ο πολίτης" +
                " κάθε μέρα. Στην πραγματικότητα, ούτε ένας πίστευε (και πιστεύει) ότι αυτές οι λύσεις" +
                " μπορεί πλέον να είναι εφικτές με την αμεσότητα που απαιτεί ο Πρωθυπουργός. Διότι " +
                "προφανώς δεν έρχονται από τον ουρανό και δεν υπακούουν σε κανέναν κανόνα μαγείας…";

        paragraphs[1] = "Λερναία Ύδρα. \"Η αντιμετώπιση της καθημερινότητας μοιάζει με τη Λερναία Ύδρα. " +
                "Ένα πρόβλημα αντιμετωπίζεις, δύο ξεπετάγονται στη θέση του\" σχολίαζε αργότερα ένας υπουργός. " +
                "Απέφυγε να προσθέσει ότι \"πρέπει να κάνουμε ό,τι και ο Ηρακλής, για να εξοντώσουμε το τέρας\", " +
                "αλλά και να το έλεγε, κανείς δεν θα τον πίστευε. Η πρακτική άλλωστε τού \"πονάει δόντι, κόβω " +
                "κεφάλι\" είναι μια καλή τακτική όταν έχεις όλο τον χρόνο μπροστά σου. Όχι τώρα, που ο " +
                "χρόνος τρέχει και στο βάθος διακρίνεται ήδη το τέλος της διαδρομής… Αν κανείς θέλει να " +
                "εξετάσει την κατάσταση με βάση τα πραγματικά στοιχεία, ασφαλώς θα καταλήξει σε μια βασική " +
                "εκτίμηση και δύο σενάρια: Η εκτίμηση αφορά το πόσο κοντά ή το πόσο μακριά είναι οι εκλογές. " +
                "Ό,τι και να λένε ο Πρωθυπουργός και τα κυβερνητικά στελέχη, ο πραγματικός χρόνος καθαρής " +
                "διακυβέρνησης της χώρας είναι πλέον λιγότερο από έξι μήνες - μόλις πέντε για την ακρίβεια. " +
                "Όση και η διάρκεια της ελληνικής προεδρίας. Στο τέλος του Ιουνίου, με την αυλαία της προεδρίας, " +
                "ανοίγει μια άλλη αυλαία, αυτή της παρατεταμένης προεκλογικής περιόδου που θα οδηγήσει στις εκλογές.";
        this.extractor = new TextExtractor();
    }

    @Test
    public void testSentenceExtraction() {
        List<String> sents = extractor.getSentencesFromParagraph(paragraphs[0]);
        Assert.assertEquals(3, sents.size());
    }

    @Test
    public void testSentenceExtraction2() {
        List<String> sents = extractor.getSentencesFromParagraph(paragraphs[1]);
        Assert.assertEquals(9, sents.size());
    }
}
